In [2]:
import pandas as pd

student_info = [('George', 78, 'Australia'),
			('Micheal', 189, 'Germany'),
			('Oliva', 140, 'Malaysia'),
			('James', 95, 'Uganda'),
			('James', 96, 'Uganda'),
			('Oliva', 140, 'Malaysia'),
			('Elijah', 391, 'Japan'),
			('Chris', 167, 'Germany'),
			('Chris', 167, 'Germany')
			]

df = pd.DataFrame(student_info, columns = ['Student_name', 'Student_id', 'Student_city'])
df

  Student_name  Student_id Student_city
0       George          78    Australia
1      Micheal         189      Germany
2        Oliva         140     Malaysia
3        James          95       Uganda
4        James          96       Uganda
5        Oliva         140     Malaysia
6       Elijah         391        Japan
7        Chris         167      Germany
8        Chris         167      Germany

In [3]:
# print(df.duplicated())

In [4]:
# identify  if the whole row is the same (True means that it has a match. True could be deleted)

whole_row_df = df.duplicated()
whole_row_df
# new_duplicate = df[df.duplicated(['Student_name','Student_city'])]
# new_duplicate
# print("Duplicate values in City :")
# print(new_duplicate)

0    False
1    False
2    False
3    False
4    False
5     True
6    False
7    False
8     True
dtype: bool

In [5]:
whole_row_df = df[df.duplicated()]
whole_row_df

  Student_name  Student_id Student_city
5        Oliva         140     Malaysia
8        Chris         167      Germany

In [6]:
# multiple column duplicate - prints out the list  that are duplicate. Note: only the extras that can be deleted
multi_column_df = df[df.duplicated(['Student_name','Student_city'])]
multi_column_df

  Student_name  Student_id Student_city
4        James          96       Uganda
5        Oliva         140     Malaysia
8        Chris         167      Germany

In [7]:
df.duplicated(['Student_name','Student_city'])

0    False
1    False
2    False
3    False
4     True
5     True
6    False
7    False
8     True
dtype: bool

In [8]:
# single column duplicate 
single_column_df = df[df.duplicated('Student_city')]
single_column_df

  Student_name  Student_id Student_city
4        James          96       Uganda
5        Oliva         140     Malaysia
7        Chris         167      Germany
8        Chris         167      Germany

In [9]:
df.duplicated('Student_city')
df.duplicated('Student_city', keep = False)

0    False
1     True
2     True
3     True
4     True
5     True
6    False
7     True
8     True
dtype: bool

In [10]:
all_df = df[df.duplicated('Student_city', keep = "last")]
all_df

  Student_name  Student_id Student_city
1      Micheal         189      Germany
2        Oliva         140     Malaysia
3        James          95       Uganda
7        Chris         167      Germany

In [11]:
df

  Student_name  Student_id Student_city
0       George          78    Australia
1      Micheal         189      Germany
2        Oliva         140     Malaysia
3        James          95       Uganda
4        James          96       Uganda
5        Oliva         140     Malaysia
6       Elijah         391        Japan
7        Chris         167      Germany
8        Chris         167      Germany

In [12]:
# Creating a new Df: with inplace = true can't display it if  tryingto  createa  new df (i.e. drop test = and it will overwrite.)
test = df.drop_duplicates(keep="first", inplace=True)
test

In [15]:
# without inplace = true can create  new df. Keep = False ensures all duplicate first/last is removed
test1 = df.drop_duplicates('Student_city', keep=False)
test1

  Student_name  Student_id Student_city
0       George          78    Australia
2        Oliva         140     Malaysia
6       Elijah         391        Japan